Revit 2024 API
BuiltInFailures.MassFailures.OpenGeometryOnly Property
 Mass contains only mesh geometry, which can't be used to compute Mass Floors, volume, or surface area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpenGeometryOnly { get; }
Visual Basic
Public Shared ReadOnly Property OpenGeometryOnly As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpenGeometryOnly {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace